## Chapter 6: Keep SQL in Your Toolset

For over 50 years, SQL, the Structured Query Language, has been the primary way database developers create and manipulate table-based relational databases. In fact, developers often refer to relational databases as SQL databases. This chapter examines SQL operations in detail. As you will learn, SQL is the language you will use to speak (interact) with a database and the tables it contains. SQL provides queries that let you create databases, tables within the database, and then to insert, update, and delete data records within those tables.

This notebook performs operations on databases which have been pre-built for you. The commands used to build these databases can be found in the chapter06-databases.sql script file located in the chapter folder.

*Note: None of the code found in this notebook is valid in the Jupyter environment. You are to run the code in the MySQL Workbench instance you prepared in *Getting Started with MySQL Workbench.*

# Performing Database Queries

Before you can use SELECT to query a table within a database, you first must issue the SQL USE query to specify the database you want to use. To view the list of available databases to which you can connect, issue the SHOW DATABASES query:

In [ ]:
SHOW DATABASES

The following USE command, for example, directs the database server to use the CHAPTER06 database.

In [ ]:
USE CHAPTER06

To view the list of tables the database contains, issue the SHOW TABLES query:

In [ ]:
SHOW TABLES

Using the SELECT query, you specify the names of columns you want your database query to return. For example, the following SELECT query returns the Lastname column for all records within the Employees table:

In [ ]:
SELECT Lastname FROM Employees

Often, you will want to retrieve data for more than one field. In such cases, you simply separate the field names with commas. The following SELECT query, for example, displays each employee’s first name, last name, and e-mail address:

In [ ]:
############################
# Chapter 6 / Deliverable 1
############################

SELECT Firstname, Lastname, Email FROM Employees

When you first start working with a table, you may not know the names of the table fields and you may want to take a look at the data the table contains. In such cases, use the asterisk wildcard character to direct SELECT to return all the fields for each record in table as shown here:

In [ ]:
SELECT * FROM Employees

When you execute a SELECT query, SQL will display all the matching records. When your tables are small, displaying all the records may not be a problem. As your table size increases, you can limit the number of records SELECT returns using the LIMIT keyword and specifying the number of records you desire. The following SELECT query, for example, uses LIMIT to direct SELECT to display only the first five records in the Employees table:

In [ ]:
SELECT * FROM Employees LIMIT 5

# Sorting Query Results

Often, the first way database developers analyze data is simply to sort the data from highest to lowest (descending) or lowest to highest (ascending) order based on the value of one or more fields. To sort the results of a SELECT query, you use the ORDER BY clause. The following SELECT query, for example, sorts the Employees table by last name:

In [ ]:
SELECT * FROM Employees ORDER BY LastName

To sort records in descending order, you include the DESC keyword after your sort-field names. Similarly, to force ascending order, you use the ASC keyword. The following SELECT query displays students by GPA in descending order:

In [ ]:
SELECT * FROM Students ORDER BY GPA DESC

Depending on your data, there may be times when you will want to sort your query results based upon multiple fields. In such cases, you separate those fields with commas following the ORDER BY clause. SQL will first sort the data based upon the first field. Then, within that sorted results, SQL with sort related records based upon the second field. SQL will perform similar processing for the remaining fields. For example, the following SELECT query will sort employee data by region, and then by last name:

In [ ]:
############################
# Chapter 6 / Deliverable 2
############################

SELECT * FROM Employees ORDER BY Region, Lastname

# Selecting Rows that Meet a Specific Criteria

By default, the SELECT query will return every record the specified table contains. When your tables are small, viewing all records may be fine. Normally, however, you want to retrieve only those records that meet a specific condition, such as students with a grade of B or higher, salespeople working on the West Coast, or products with an inventory level greater than 100. Database developers refer to such query operations as filtering the data.

To specify a condition within a SELECT query, you add a WHERE clause:

```mysql
SELECT Field(s) FROM Table WHERE Condition
```

Assume, for example, you are using the Employees table previously shown. The following SELECT query uses a WHERE clause to display only those employees working in New York:

In [ ]:
############################
# Chapter 6 / Deliverable 3
############################

SELECT * FROM Employees WHERE City='New York'

In a similar way, the following query uses a WHERE clause to view records for employees with the last name ‘Smith’:

In [ ]:
SELECT * FROM Employees WHERE Lastname='Smith'

Finally, the following SELECT query will display the first name, last name, and phone numbers for employees who work in California:

In [ ]:
SELECT Firstname, Lastname, Phone FROM Employees WHERE State='California'

# Using Conditional Operators

The previous queries have used the SQL equality operator, the equals sign (=), to test for columns whose values are equal to the value specified in the WHERE clause. However, SQL also supports several relational operators you can use within a WHERE clause condition.

The following query, for example, uses the greater-than-or-equal-to (>=) relational operator to display employees who have worked for the company for 10 or more years:

In [ ]:
SELECT * FROM Employees WHERE Years >= 10

In a similar way, the following query lists employees who make less than $30,000:

In [ ]:
SELECT * FROM Employees WHERE Salary < 30000

The SQL BETWEEN operator lets you compare a range of values. For example, the following query returns the employees that make between \$50,000 and \\$75,000 a year:

In [ ]:
############################
# Chapter 6 / Deliverable 4
############################

SELECT * FROM Employees WHERE Salary BETWEEN 50000 AND 75000

The SQL IN operator lists you compare a column’s value to a specified set of values. For example, the following query lists the employees that live in New York, Los Angeles, or Seattle:

In [ ]:
SELECT * FROM Employees WHERE CITY IN ('New York', 'Los Angeles', 'Seattle')

The following SELECT query uses the percent-sign wildcard with the LIKE clause to display Employees whose last names begin with the letters ‘Jo’:

In [ ]:
SELECT * FROM Employees WHERE Lastname LIKE 'Jo%'

In a similar way, the following SELECT query displays employees with New York area codes (212):

In [ ]:
############################
# Chapter 6 / Deliverable 5
############################

SELECT * FROM Employees WHERE Phone LIKE ('212%')

Finally, this query uses two underscore wildcards to display employees who work in the west or east regions:

In [ ]:
SELECT * FROM Employees WHERE Region LIKE '__ST'

The following SELECT query uses the logical AND operator to display the salespeople who live in New York:

In [ ]:
############################
# Chapter 6 / Deliverable 6
############################

SELECT * FROM Employees WHERE City='New York' AND Team='Sales'

The SQL logical AND operator includes a record only if both conditions are true. In this case, the query only considers a record a match if the City field is ‘New York’ and the record’s Team field is ‘Sales’. The SQL logical OR operator, in contrast, includes the record if either condition (or both) is true. The following SELECT query, for example, will list employees that work in either Sales or Marketing:

In [ ]:
SELECT * FROM Employees WHERE Team='Sales' OR Team='Marketing'

The SQL NOT operator directs SQL to include a record if the specified condition is not met. For example, the following query would list employees who do not live in California, New York, or Arizona:

In [ ]:
SELECT * FROM Employees WHERE State NOT IN ('California', 'New York', 'Arizona')

By default, when you perform a SELECT query, SQL displays the table’s field name at the top of the query results. For example, the following SELECT query displays all fields from the Employees table:

In [ ]:
SELECT * FROM Employees

When you execute this query, SQL will display the table’s field names across the top of its results followed by the field values.

Depending on how you are using your query results, there may be times when you will want to direct SELECT to display specific field names. In such cases, you use the AS keyword. The following query, for example, directs SELECT to use the field names Employee Last Name and Employee Salary within the query results:

In [ ]:
SELECT Lastname AS 'Employee Last Name', Salary As 'Employee Salary' FROM Employees

# Using the SQL Built-in Aggregate Functions

Another useful set of tools in the MySQL provides are the built-in aggregate functions, so-named because they work with an aggregate, or group, of records.

One example is the SQL COUNT function, which you can use to determine the number of records the query returns. The following SQL query directs SELECT to display a count of the number of records in the Employees table:

In [ ]:
SELECT COUNT(*) FROM Employees

The following query, uses the AS keyword to direct SELECT to use the field name ‘Number of Records’ within the result:

In [ ]:
############################
# Chapter 6 / Deliverable 7
############################

SELECT COUNT(*) AS 'Number of Records' FROM Employees

As we have learned, the SQL COUNT function returns the number of records a SELECT query returns. We can combine this function with a comparison operator to increase the specifity of our search. Take the following query for example, which uses COUNT to display the number of students with a GPA greater than 3.5:

In [ ]:
SELECT COUNT(*) FROM Students WHERE GPA > 3.5

In a similar way, the following query uses the AVG and STDDEV functions to display the average student GPA along with the standard deviation:

In [ ]:
SELECT AVG(GPA), STDDEV(GPA) FROM Students

Finally, the following query uses the SUM, MIN, and MAX functions to display salary information:

In [ ]:
############################
# Chapter 6 / Deliverable 8
############################

SELECT SUM(Salary), MIN(Salary), MAX(Salary) FROM Employees

# Performing Arithmetic Operations


The following SELECT query multiplies the sales amount by 5% to determine the sales-tax amount:

In [ ]:
SELECT Price, Price*0.05 AS 'Tax Amount' FROM Products WHERE ProductID=7

To display the tax amount for every product, you can use the following query:

In [ ]:
SELECT Description, Price, Price*0.05 AS 'Tax Amount' FROM Products

There may be times when you must perform more complex arithmetic operations beyond the SUM, AVG, and STDDEV options previously discussed. To help you perform such operations, SQL provides the arithmetic functions.

For example, the following SELECT query uses the ROUND function to round the values into dollars and cents:

In [ ]:
SELECT Company, ROUND(Price, 2) AS ‘Price’ FROM Stocks

# Grouping Query Results with GROUP BY

Often, you will perform queries to create reports that summarize key operations. For example, you may produce a monthly sales report that summarizes your sales team's results. Depending on the size of your sales team, you may want to group results by division, by region, by sales manager, or even by a combination of each. To perform such operations, you can use the SELECT query GROUP BY clause.

The following query, for example, displays current sales data:

In [ ]:
SELECT * FROM Sales

To better analyze your sales, you decide to group the data by region, displaying a count of the number of salespeople in each region. To do so, you would use the GROUP BY clause as follows:

In [ ]:
SELECT Region, COUNT(*) FROM SALES GROUP BY Region

As you have learned, to filter queries, you use the WHERE clause to specify a condition:

In [ ]:
SELECT * FROM Students WHERE Instructor='Jones'

However, when you use a GROUP BY clause within a SELECT query, you must specify WHERE before you group. As you may imagine, that means WHERE filters rows before grouping. To filter rows after grouping, you must use the HAVING clause. If you try to use a WHERE clause after GROUP BY, SQL will display a syntax error message:

In [ ]:
SELECT Region, COUNT(*) FROM SALES GROUP BY Region WHERE Region='West'

To correct this error, execute the command using the HAVING clause:

In [ ]:
SELECT Region, COUNT(*) FROM SALES GROUP BY Region HAVING Region='West'

The following query will display the subtotals for the inventory contained in each state:

In [ ]:
#############################
# Chapter 6 / Deliverable 9
#############################

SELECT State, Product, SUM(Quantity) 
FROM Inventory
GROUP BY State

Although having state subtotals is valuable, you likely also want to know the total inventory. In such cases, you can use a ROLLUP within the query to direct SQL to “roll up” the subtotals:

In [ ]:
SELECT State, Product, SUM(Quantity) 
FROM Inventory
GROUP BY State WITH ROLLUP

As you can see, SQL does not display a label for the inventory grand total (actually, SQL displays a null). To display a label, you can add a COALESCE statement that directs SQL to substitute the value specified in place of the null, as shown here:

In [ ]:
SELECT COALESCE(State, 'Total Inventory') State, Product, SUM(Quantity)
FROM Inventory
GROUP BY State WITH ROLLUP

The following query uses a ROLLUP to display a summary of products within each state:

In [ ]:
SELECT State, Product, SUM(Quantity)
FROM Inventory
GROUP BY State, Product WITH ROLLUP

Finally, the following query produces your complete report:

In [ ]:
#############################
# Chapter 6 / Deliverable 10
#############################

SELECT COALESCE(State, 'Total Inventory') State,
COALESCE(Product, '') Product,
COALESCE(Model, '') Model, SUM(Quantity)
FROM Inventory
GROUP BY State, Product, Model WITH ROLLUP

# Joining One Table to Another 

When you normalize your data design, you will often break one or more tables to achieve your desired normal form. When you later need to query the data, you will need to put the tables back together temporarily for the duration of the query's execution. In such cases you would perform a JOIN operation. The following query, for example, JOINs the Customers and Orders table on a common field (CustomerID):

In [ ]:
SELECT Customers.Lastname, Orders.ProductID FROM Customers
JOIN Orders ON Customers.CustomerID = Orders.CustomerID

There’s a lot going on within this query—first, the query precedes the field names with the table names (such as Customers.Lastname). Because JOIN operations use two tables that may each use the same field names, by preceding the field names with the table names, you reduce any chance of confusion as to which field the query references. Next, the JOIN query specifies the name of the second table and the fields within each table upon which the JOIN will be made. As the query executes, SQL will create a temporary table behind the scenes which contains the fields of both tables for the records for which the JOIN fields are equal.

The following query extends the previous JOIN operation to display all the fields within the resultant table:

In [ ]:
SELECT * FROM Customers JOIN Orders WHERE Customers.CustomerID = Orders.CustomerID

When you perform a JOIN operation, to avoid field-name conflicts, you will precede field names with the corresponding table names. To reduce your typing and the length of your queries, SQL lets you create table alias names, to which your query can refer, as a shorthand alternative to the longer table name. The following query uses the table aliases c for Customers and o for Orders. To specify an alias name, you include the alias after the table name reference:

In [ ]:
#############################
# Chapter 6 / Deliverable 11
#############################

SELECT * FROM Customers c JOIN Orders o WHERE c.CustomerID = o.CustomerID

An inner-join returns the intersection between two tables. To direct SQL to perform an inner join, you include the keyword INNER as shown here:

In [ ]:
SELECT c.Lastname, o.OrderID FROM Customers c 
INNER JOIN Orders o WHERE c.CustomerID = o.CustomerID

Given the customers and orders scenario, you may want to know the names of customers who have not yet placed an order. In such cases, you can perform a different type of JOIN operation that directs SQL not only to return the matching records, but also the records for customers that do not have a matching orders record. 

A left-join operation will include all matching records, plus records from the table specified on the left that do not have matching records.
Because this JOIN operation includes all the records from the left table, the JOIN operation is called a left join. To direct SQL to perform a left join, you include the LEFT keyword within the query as shown here:

In [ ]:
SELECT c.Lastname, o.OrderID FROM Customers c 
LEFT JOIN Orders o ON c.CustomerID = o.CustomerID

When SQL creates the resulting left-join table, the Orders table will not have matching CustomerID fields for some of the records, and as such, SQL will not have data to include in the Orders table’s side of the JOIN record. When a match does not occur, SQL will assign null values to each field within the Order’s side of the table.
Knowing that SQL will assign null values to the missing fields, you can create a query that tests for OrderID IS NULL in order to retrieve the customers who have not yet placed an order:

In [ ]:
#############################
# Chapter 6 / Deliverable 12
#############################

SELECT c.Lastname FROM Customers c 
LEFT JOIN Orders o ON c.CustomerID = o.CustomerID
WHERE OrderID IS NULL

If you are auditing the company’s data, you might want to confirm that every order has an existing customer. In this case, you can perform a right-join operation to retrieve not only the matching records, but also every record that appears in the table specified on the right side of the JOIN operation.

In this case, if SQL cannot find a matching customer for an order, it will assign null values to fields within the temporary JOIN table. The following query performs right join and tests for a null value to determine orders without a customer:

In [ ]:
SELECT o.OrderID FROM Customers c 
RIGHT JOIN Orders o ON c.CustomerID = o.CustomerID
WHERE c.CustomerID IS NULL

As you just learned, an SQL JOIN operation lets you temporarily combine two tables based upon a related field. In a related way, SQL UNION and INTERSECT operations let you combine the results of two queries. The UNION operation will produce a result that contains all records from the two tables. The INTERSECT operation will produce a result that contains only those records that appear in both queries. 
For example, assume you want to know the states for which a university has instructors and students. In such a case, you can use the following UNION query:

In [ ]:
#############################
# Chapter 6 / Deliverable 13
#############################

SELECT State FROM Instructors
UNION
SELECT State FROM Students

# Importing Data from a Different Database Table

Often, you may need to move data from one table into another. In such cases, you can use the MySQL INSERT INTO query. The following query, for example, copies data from the Sales table into the NewSales table:

In [ ]:
INSERT INTO NewSales SELECT * FROM Sales

Likewise, the following query uses INSERT INTO to copy the contents of the Employees table to a backup table named EmployeesBackup:

In [ ]:
INSERT INTO EmployeesBackup SELECT * FROM Employees

The previous INSERT INTO queries copied all fields from the source table. There may be times, however, when you only want to insert specific fields, in such cases, you specify the desired fields within your SELECT query.

In addition, there may be times when you will want to copy the contents of a table that resides in a different database. In such cases, you simply precede the table name with the database name and a period. The following command, for example, would display records contained in the Chapter06 database Students table:

```mysql
INSERT INTO StudentsBackup SELECT * From Chapter06.Students
```
Note: Before you can insert one table into another, both tables must exist.